In [1]:
import pandas as pd
import numpy as np

In [5]:
# Import Dataset

ath_df = pd.read_excel(r"C:\Users\Avniiii\Data_Analytics_class\datasets\EntriesGender.xlsx")

In [6]:
ath_df.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [7]:
ath_df.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [8]:
ath_df.describe()

           Female         Male       Total
count   46.000000    46.000000    46.00000
mean   118.086957   127.913043   246.00000
std    147.169717   166.900746   312.46134
min     10.000000     0.000000    19.00000
25%     42.750000    40.250000    85.50000
50%     90.000000    97.500000   190.00000
75%    138.750000   149.750000   288.75000
max    969.000000  1072.000000  2041.00000

In [10]:
ath_df.shape

(46, 4)

In [11]:
ath_df.columns

Index(['Discipline', 'Female', 'Male', 'Total'], dtype='object')

In [12]:
# Maximum No. Of Atheletes

ath_df.max()

Discipline    Wrestling
Female              969
Male               1072
Total              2041
dtype: object

In [13]:
# Minimum No. of Atheletes

ath_df.min()

Discipline    3x3 Basketball
Female                    10
Male                       0
Total                     19
dtype: object

In [25]:
# Maximum No. of Men Athemetes in Perticular Game

ath_df.loc[ath_df['Male'].max()==ath_df['Male'],['Discipline','Male']]

  Discipline  Male
4  Athletics  1072

In [26]:
# Minimum No. of Men Athemetes in Perticular Game

ath_df.loc[ath_df['Male'].min()==ath_df['Male'],['Discipline','Male']]

             Discipline  Male
3     Artistic Swimming     0
28  Rhythmic Gymnastics     0

In [27]:
# Maximum No. of Female Athemetes in Perticular Game

ath_df.loc[ath_df['Female'].max()==ath_df['Female'],['Discipline','Female']]

  Discipline  Female
4  Athletics     969

In [28]:
# Minimum No. of Female Athemetes in Perticular Game

ath_df.loc[ath_df['Female'].min()==ath_df['Female'],['Discipline','Female']]

               Discipline  Female
12  Cycling BMX Freestyle      10

In [34]:
# Game Played By Most of the Male

ath_df.loc[ath_df['Male'].max()==ath_df['Male'],['Discipline']]

  Discipline
4  Athletics

In [35]:
# Game Played By Most of the Female
ath_df.loc[ath_df['Female'].max()==ath_df['Female'],['Discipline']]

  Discipline
4  Athletics

In [37]:
# Game only Played By Male

ath_df.loc[ath_df['Female']==0]

Empty DataFrame
Columns: [Discipline, Female, Male, Total]
Index: []

In [39]:
# Game only Played By Female

ath_df.loc[ath_df['Male']==0,['Discipline']]

             Discipline
3     Artistic Swimming
28  Rhythmic Gymnastics

In [44]:
# Most Famous Game 
ath_df[ath_df['Total'].max()==ath_df['Total']]

  Discipline  Female  Male  Total
4  Athletics     969  1072   2041